// ДЗ 1.


//Реализуйте структуру телефонной книги с помощью HashMap, учитывая, что 1 человек может иметь несколько телефонов.

//Пусть дан список сотрудников:Иван Иванов ( и остальные, полный текст дз будет на платформе)
//Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений. Отсортировать по убыванию популярности.

//Реализовать алгоритм пирамидальной сортировки (HeapSort).

//На шахматной доске расставить 8 ферзей так, чтобы они не били друг друга.

//Светлана Петрова
//
//Кристина Белова
//
//Анна Мусина
//
//Анна Крутова
//
//Иван Юрин
//
//Петр Лыков
//
//Павел Чернов
//
//Петр Чернышов
//
//Мария Федорова
//
//Марина Светлова
//
//Мария Савина
//
//Мария Рыкова
//
//Марина Лугова
//
//Анна Владимирова
//
//Иван Мечников
//
//Петр Петин
//
//Иван Ежов


public class SolutionHW_5_1 {
    public static void main(String[] args) {

    }
}
